/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   heredoc.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gshim <gshim@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/30 18:12:47 by gshim             #+#    #+#             */
/*   Updated: 2022/03/30 18:27:33 by gshim            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	heredoc(t_tree_node *root, t_tree_node *right, bool flag)
{
	char *buffer[256];

	// 무한반복
		// readline으로 한줄씩 계속해서 입력받는다.
		// 한줄이 right->command[0]와 일치하면 루프를 빠져나온다. [break]
		// 일치하지 않으면 입력을 저장한다.

	// 버퍼를 차례대로 출력한다.
}